{
    "dialogue": [
        {
            "speaker": "Deemo",
            "line": "Thank you for helping me Zed."
        },
        {
            "speaker": "Zed",
            "line": "No worries. I can kill 2 birds in 1 stone if I help you."
        },
        {
            "speaker": "Deemo",
            "line": "Right. My spaceship uses garbage as a fuel in order to work. The trash can either be biodegradable or non-biodegradable."
        },
        {
            "speaker": "Zed",
            "line": "Wow! How convenient."
        },
        {
            "speaker": "Deemo",
            "line": "Yes, it's a unique system. Biodegradable and non-biodegradable trash is converted into energy directly."
        },
        {
            "speaker": "Zed",
            "line": "Your world is very futuristic. Same for this garbage harpoon gun that lent to me."
        },
        {
            "speaker": "Deemo",
            "line": "Yeah. This gun of mine will help you to collect trash easily like a magnet attracting metals."
        },
        {
            "speaker": "Zed",
            "line": "That's awesome. I bet it makes the job a lot faster."
        },
        {
            "speaker": "Deemo",
            "line": "Definitely. Without it, collecting trash in space would be much more challenging."
        },
        {
            "speaker": "Zed",
            "line": "I don’t even know if earth is heaven or hell for having many trash that created by we humans."
        },
        {
            "speaker": "Deemo",
            "line": "It’s fortunate for me."
        },
        {
            "speaker": "Zed",
            "line": "Well it is very fortunate for us that you are here collecting our waste specially in the sea. Collecting trash in the sea is very troublesome."
        },
        {
            "speaker": "Deemo",
            "line": "Yes, but I cannot use the fuel if my spaceship is broken."
        },
        {
            "speaker": "Zed",
            "line": "I saw that the spaceship has missing parts."
        },
        {
            "speaker": "Deemo",
            "line": "My spaceship missing 3 of its parts, but I don’t have any idea where the parts went."
        },
        {
            "speaker": "Zed",
            "line": "Well we cannot find anything if we keep in idle here. Maybe some clues will appear as we collect trash along the way."
        },
        {
            "speaker": "Deemo",
            "line": "You are right."
        },
        {
            "speaker": "Zed",
            "line": "Then let’s go."
        }





    ]
}
